decare/horizon/testing/getPayments/Request_1/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.service.member.portal.dds.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:getPayments>
         <ClientName>?</ClientName>
         <UserName>?</UserName>
         <ClientTransactionId>?</ClientTransactionId>
         <SourceSystem>DECARE</SourceSystem>
         <!--Optional:-->
         <ClientSubmitDateTime>?</ClientSubmitDateTime>
         <!--Optional:-->
         <ClientSessionId>?</ClientSessionId>
         <!--Optional:-->
         <Timeout>60</Timeout>
         <PaymentSearchCriteria>
            <MaxRowsToReturn>100</MaxRowsToReturn>
            <!--Optional:-->
            <ProviderParStatus>?</ProviderParStatus>
            <!--Optional:-->
            <ProviderId>800384593</ProviderId>
            <SubscriberId>3HZN86819480</SubscriberId>
            <!--Optional:-->
            <ClaimId>48762065</ClaimId>
            <!--Optional:-->
            <ClaimPaymentEFTTraceNo>?</ClaimPaymentEFTTraceNo>
            <!--Optional:-->
            <ClaimPaymentCheckNo>?</ClaimPaymentCheckNo>
            <!--Optional:-->
            <ClaimPaymentCheckDate>?</ClaimPaymentCheckDate>
            <!--Optional:-->
            <ClaimPaymentSourceSystem>?</ClaimPaymentSourceSystem>
            <!--Optional:-->
            <IncludePIDSearch>?</IncludePIDSearch>
            <!--Optional:-->
            <IncludeClaimHeader>?</IncludeClaimHeader>
            <!--Optional:-->
            <IncludeClaimHistory>?</IncludeClaimHistory>
            <!--Optional:-->
            <IncludeClaimPayeeAddress>?</IncludeClaimPayeeAddress>
         </PaymentSearchCriteria>
      </ws:getPayments>
   </soapenv:Body>
</soapenv:Envelope>
